package ru.inurgalimov.io;

/**
 * Console chat.
 * The user enters the word-phrase, the program takes a random phrase from a text file and displays it in response.
 * @author Nurgalimov Ilshat
 * @version 15.01.2019
 */
public class ConsoleСhat {
    /*Создать программу консольный чат. Пользователь вводит слово-фразу, программа берет случайную фразу из текстового
    файла и выводит в ответ. Программа замолкает если пользователь вводит слово «стоп» при этом он может продолжать
    отправлять сообщения в чат. Если пользователь вводит слово «продолжить» , программа снова начинает отвечать.
    При вводе слова «закончить» программа прекращает работу.
    Запись диалога включая, слова-команды стоп/продолжить/закончить записать в текстовый лог.
    Так делать не надо. while (true) { - консольный чат. должен явно выходить из цикла. не делайте вечный цикл.
     */
}
